load.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://localhost:3000
  phases:
    - duration: 10
      arrivalRate: 10
      rampTo: 10
      name: Load phase
  # Load & configure a couple of useful plugins
  # https://artillery.io/docs/reference/extensions
  plugins:
    ensure:
      thresholds:
        - http.response_time.p99: 100
        - http.response_time.p95: 75
    apdex:
      threshold: 100
    metrics-by-endpoint: {}
scenarios:
  - flow:
      - loop:
          - get:
              url: '/slow'
        count: 100